{
  "task_type": "CAUSAL_LM",
  "peft_type": "LORA",
  "auto_mapping": null,
  "peft_version": "0.18.1",
  "base_model_name_or_path": null,
  "revision": null,
  "inference_mode": false,
  "r": 16,
  "target_modules": 